TerryFogg/nf-Community-Targets/ThreadX/ST/STM32F0/Common/DeviceIO.cpp
//
// Copyright (c) .NET Foundation and Contributors
// See LICENSE file in the project root for full license information.
//
#include "DeviceIO.h"
#include "board.h"

#pragma region STM32 definitions

GPIO_INTERRUPT_SERVICE_ROUTINE *SavedInterruptCallBack[16];
int16_t SavedInterruptPinNumber[16];

uint32_t GpioPortClockEnable[] = {
    LL_AHB4_GRP1_PERIPH_GPIOA,
    LL_AHB4_GRP1_PERIPH_GPIOB,
    LL_AHB4_GRP1_PERIPH_GPIOC,
    LL_AHB4_GRP1_PERIPH_GPIOD,
    LL_AHB4_GRP1_PERIPH_GPIOE,
    LL_AHB4_GRP1_PERIPH_GPIOF,
    LL_AHB4_GRP1_PERIPH_GPIOH,
#ifdef GPIOI
    LL_AHB4_GRP1_PERIPH_GPIOI,
#else
    0,
#endif
    LL_AHB4_GRP1_PERIPH_GPIOJ,
    LL_AHB4_GRP1_PERIPH_GPIOK};
uint32_t UsartPortClockEnable[] = {
    LL_APB2_GRP1_PERIPH_USART1,
    LL_APB1_GRP1_PERIPH_USART2,
    LL_APB1_GRP1_PERIPH_USART3,
    0,
    0,
    LL_APB2_GRP1_PERIPH_USART6,
    0,
    0,
    0,
    LL_APB2_GRP1_PERIPH_USART10};
uint32_t DmaClockEnable[] = {
    LL_AHB1_GRP1_PERIPH_DMA1,
    LL_AHB1_GRP1_PERIPH_DMA2,
};
uint32_t PinMask[] = {
    LL_GPIO_PIN_0,
    LL_GPIO_PIN_1,
    LL_GPIO_PIN_2,
    LL_GPIO_PIN_3,
    LL_GPIO_PIN_4,
    LL_GPIO_PIN_5,
    LL_GPIO_PIN_6,
    LL_GPIO_PIN_7,
    LL_GPIO_PIN_8,
    LL_GPIO_PIN_9,
    LL_GPIO_PIN_10,
    LL_GPIO_PIN_11,
    LL_GPIO_PIN_12,
    LL_GPIO_PIN_13,
    LL_GPIO_PIN_14,
    LL_GPIO_PIN_15,
    LL_GPIO_PIN_ALL};
GPIO_TypeDef *Port[] = {
    GPIOA,
    GPIOB,
    GPIOC,
    GPIOD,
    GPIOE,
    GPIOF,
    GPIOG,
    GPIOH,
#ifdef GPIOI
    GPIOI,
#else
    (GPIO_TypeDef *)-1,
#endif
    GPIOJ,
    GPIOK};
uint32_t EXTI_Line[] = {
    LL_EXTI_LINE_0,
    LL_EXTI_LINE_1,
    LL_EXTI_LINE_2,
    LL_EXTI_LINE_3,
    LL_EXTI_LINE_4,
    LL_EXTI_LINE_5,
    LL_EXTI_LINE_6,
    LL_EXTI_LINE_7,
    LL_EXTI_LINE_8,
    LL_EXTI_LINE_9,
    LL_EXTI_LINE_10,
    LL_EXTI_LINE_11,
    LL_EXTI_LINE_12,
    LL_EXTI_LINE_13,
    LL_EXTI_LINE_14,
    LL_EXTI_LINE_15};
uint32_t SyscfgPorts[] = {
    LL_SYSCFG_EXTI_PORTA,
    LL_SYSCFG_EXTI_PORTB,
    LL_SYSCFG_EXTI_PORTC,
    LL_SYSCFG_EXTI_PORTD,
    LL_SYSCFG_EXTI_PORTE,
    LL_SYSCFG_EXTI_PORTF,
    LL_SYSCFG_EXTI_PORTG,
    LL_SYSCFG_EXTI_PORTH,
#ifdef GPIOI
    LL_SYSCFG_EXTI_PORTI,
#else
    -1,
#endif
    LL_SYSCFG_EXTI_PORTJ,
    LL_SYSCFG_EXTI_PORTK};
// Arranged so index 1 == I2C1, etc...
IRQn_Type I2C_Interrupt_Channel[] = {
    I2C1_ER_IRQn,
    I2C2_ER_IRQn,
    I2C3_ER_IRQn,
    I2C4_ER_IRQn,
#ifdef I2C5
    I2C5_ER_IRQn
#endif
};
ADC_TypeDef *ADC_Channel[] = {
    NULL, // No Channel zero
    ADC1,
    ADC2,
#ifdef ADC3
    ADC3,
#else
    (ADC_TypeDef *)-1,
#endif
};
DMA_TypeDef *DMA_Channel[] = {
    NULL, // No Channel zero
    DMA1,
    DMA2};
DAC_TypeDef *DAC_Channel[] = {
    NULL, // No Channel zero
    DAC1,
#ifdef DAC2
    DAC2,
#endif
#ifdef DAC3
    DAC3,
#else
    (DAC_TypeDef *)-1,
#endif
};
I2C_TypeDef *I2C_Channel[] = {
    NULL, // No Channel zero
    I2C1,
    I2C2,
    I2C3,
    I2C4,
#ifdef I2C5
    I2C5,
#else
    (I2C_TypeDef *)-1,
#endif
#ifdef I2C6
    I2C6,
#else
    (I2C_TypeDef *)-1,
#endif
};
SPI_TypeDef *SPI_Channel[] = {
    NULL, // No Channel zero
    SPI1,
    SPI2,
    SPI2,
    SPI3,
    SPI4,
    SPI5,
#ifdef SPI6
    SPI6,
#else
    (SPI_TypeDef *)-1,
#endif
};
TIM_TypeDef *PWM_Channel[] = {
    NULL, // No Channel zero
    TIM2,
    TIM3,
    TIM4,
    TIM5};
SerialChannel Serial_Channel[] = {
    {NULL, ' '}, // No Channel zero
    {USART1, 0x0D},
    {USART2, 0x0D},
    {USART2, 0x0D},
    {USART3, 0x0D},
#ifdef USART4
    USART4,
#else
    {(USART_TypeDef *)-1, ' '},
#endif
#ifdef USART5
    {USART5, 0x0D},
    USART5,
#else
    {(USART_TypeDef *)-1, ' '},
#endif
    {USART6, 0x0D},
#ifdef USART7
    {USART7, 0x0D},
#else
    {(USART_TypeDef *)-1, ' '},
#endif
#ifdef USART8
    {USART8, 0x0D},
#else
    {(USART_TypeDef *)-1, ' '},
#endif
#ifdef USART9
    {USART9, 0x0D},
#else
    {(USART_TypeDef *)-1, ' '},
#endif
    {USART10, 0x0D},
};
uint32_t AdcChannelNumber[] = {
    LL_ADC_CHANNEL_1,
    LL_ADC_CHANNEL_2,
    LL_ADC_CHANNEL_3,
    LL_ADC_CHANNEL_4,
    LL_ADC_CHANNEL_5,
    LL_ADC_CHANNEL_6,
    LL_ADC_CHANNEL_7,
    LL_ADC_CHANNEL_8,
    LL_ADC_CHANNEL_9,
    LL_ADC_CHANNEL_10,
    LL_ADC_CHANNEL_11,
    LL_ADC_CHANNEL_12,
    LL_ADC_CHANNEL_13,
    LL_ADC_CHANNEL_14,
    LL_ADC_CHANNEL_15,
};
uint32_t DmaStreamNumber[] = {
    LL_DMA_STREAM_0,
    LL_DMA_STREAM_1,
    LL_DMA_STREAM_2,
    LL_DMA_STREAM_3,
    LL_DMA_STREAM_4,
    LL_DMA_STREAM_5,
    LL_DMA_STREAM_6,
    LL_DMA_STREAM_7};

int GetI2CPin_AlternateFunctionNumber(GPIO_PIN GPIOPortByNumber, int pinNumber, DevicePinFunction dpf);

int GetI2CPin_AlternateFunctionNumber(GPIO_PIN GPIOPortByNumber, int pinNumber, DevicePinFunction dpf)
{
    uint32_t alternate = -1;
    switch (dpf)
    {
        case NONE:
        case GPIO:
        case ADC:
        case CAN:
        case DAC:
        case SPI:
        case COUNTER:
        case PWM:
        case TIMER:
        case I2C:
            if (GPIOPortByNumber == 2 && pinNumber == 8)
            {
                // PB8 - I2C1_SCL,AF4
                alternate = LL_GPIO_AF_4;
            }
            else if (GPIOPortByNumber == 2 && pinNumber == 9)
            {
                // PB9 - I2C1_SDA,AF4
                alternate = LL_GPIO_AF_4;
            }
            else if (GPIOPortByNumber == 4 && pinNumber == 12)
            {
                // PD12 - I2C4_SCL,AF4
                alternate = LL_GPIO_AF_4;
            }
            else if (GPIOPortByNumber == 4 && pinNumber == 13)
            {
                // PD13 - I2C4_SCL,AF4
                alternate = LL_GPIO_AF_4;
            }
            break;
        case I2S:
        case SD:
        case USART:
        case WAKEUP:
            break;
    }
    return alternate;
}
uint32_t I2C_GetTiming(I2cBusSpeed busSpeed)
{
    uint32_t timing;
    switch (busSpeed)
    {
        case I2cBusSpeed_StandardMode:
            timing = 0x20B0CCFF;
            break;
        case I2cBusSpeed_FastMode:
            timing = 0x00D04BFF;
            break;
        case I2cBusSpeed_FastModePlus:
            timing = 0x00601C5C;
            break;
        default:
            timing = -1;
            break;
    }
    return timing;
}

#pragma endregion

