TerryFogg/nf-Community-Targets/ThreadX/ST/STM32F0/Common/DeviceIO.cpp
#pragma region GPIO
bool GpioIO::Initialize(PinNameValue pinNameValue)
{
    int GPIOPortByNumber = pinNameValue / 16;
    if (!LL_AHB4_GRP1_IsEnabledClock(GpioPortClockEnable[GPIOPortByNumber]))
    {
        LL_AHB4_GRP1_EnableClock(GpioPortClockEnable[GPIOPortByNumber]);
    }
    return true;
}
bool GpioIO::Dispose(PinNameValue pinNameValue)
{
    GpioIO::InterruptRemove(pinNameValue);
    GpioIO::SetLowPower(pinNameValue);
    return true;
}
bool GpioIO::Read(PinNameValue pinNameValue)
{
    int GPIOPortByNumber = pinNameValue / 16;
    uint32_t gpioPortPinNumber = pinNameValue % 16;
    return (bool)LL_GPIO_IsInputPinSet(Port[GPIOPortByNumber], PinMask[gpioPortPinNumber]);
}
bool GpioIO::Write(PinNameValue pinNameValue, bool pinState)
{
    // true == 1
    // false == 0
    int GPIOPortByNumber = pinNameValue / 16;
    uint32_t gpioPortPinNumber = pinNameValue % 16;

    if (pinState == GpioPinValue_Low)
    {
        LL_GPIO_ResetOutputPin(Port[GPIOPortByNumber], PinMask[gpioPortPinNumber]);
    }
    else if (GpioPinValue_High)
    {
        LL_GPIO_SetOutputPin(Port[GPIOPortByNumber], PinMask[gpioPortPinNumber]);
    }
    return true;
}
bool GpioIO::Toggle(PinNameValue pinNameValue)
{
    bool status = false;
    int GPIOPortByNumber = pinNameValue / 16;
    uint32_t gpioPortPinNumber = pinNameValue % 16;
    LL_GPIO_TogglePin(Port[GPIOPortByNumber], PinMask[gpioPortPinNumber]);
    status = true;
    return status;
}
bool GpioIO::SetFunction(PinNameValue pinNameValue, DevicePinFunction PinFunction)
{
    int GPIOPortByNumber = pinNameValue / 16;
    uint32_t gpioPortPinNumber = pinNameValue % 16;
    bool status = false;

    switch (PinFunction)
    {
        case DevicePinFunction::NO_FUNCTION:
            status = true;
            break;
        case DevicePinFunction::ADC:
            LL_GPIO_InitTypeDef GPIO_InitStruct;
            LL_GPIO_SetPinMode(Port[GPIOPortByNumber], gpioPortPinNumber, LL_GPIO_MODE_ANALOG);
            break;
        case DevicePinFunction::CAN:
            // Not supported on this MCU
            status = false;
            break;
        case DevicePinFunction::DAC:
            status = false;
            break;
        case DevicePinFunction::GPIO:
            status = true;
            break;
        case DevicePinFunction::SPI:
            status = true;
            break;
        case DevicePinFunction::COUNTER:
            status = true;
            break;
        case DevicePinFunction::PWM:
            status = true;
            break;
        case DevicePinFunction::SD:
            status = true;
            break;
        case DevicePinFunction::TIMER:
            status = true;
            break;
        case DevicePinFunction::I2C:
        {
            LL_AHB4_GRP1_EnableClock(GpioPortClockEnable[GPIOPortByNumber]);
            LL_GPIO_SetPinMode(Port[GPIOPortByNumber], gpioPortPinNumber, LL_GPIO_MODE_ALTERNATE);
            if (gpioPortPinNumber <= 7)
            {
                LL_GPIO_SetAFPin_8_15(Port[GPIOPortByNumber], gpioPortPinNumber, alternateFunctionNumber);
            }
            if (gpioPortPinNumber >= 8)
            {
                LL_GPIO_SetAFPin_8_15(Port[GPIOPortByNumber], gpioPortPinNumber, alternateFunctionNumber);
            }
            LL_GPIO_SetPinSpeed(Port[GPIOPortByNumber], gpioPortPinNumber, LL_GPIO_SPEED_FREQ_HIGH);
            LL_GPIO_SetPinOutputType(Port[GPIOPortByNumber], gpioPortPinNumber, LL_GPIO_OUTPUT_OPENDRAIN);
        }
            status = true;
            break;
        case DevicePinFunction::I2S:
            status = true;
            break;
        case DevicePinFunction::USART:
            LL_AHB4_GRP1_EnableClock(GpioPortClockEnable[GPIOPortByNumber]);
            GPIO_InitStruct.Alternate = alternateFunctionNumber;
            GPIO_InitStruct.Pin = gpioPortPinNumber;
            GPIO_InitStruct.Mode = LL_GPIO_MODE_ALTERNATE;
            GPIO_InitStruct.Speed = LL_GPIO_SPEED_FREQ_HIGH;
            GPIO_InitStruct.OutputType = LL_GPIO_OUTPUT_PUSHPULL;
            GPIO_InitStruct.Pull = LL_GPIO_PULL_NO;
            LL_GPIO_Init(Port[GPIOPortByNumber], &GPIO_InitStruct);
            status = true;
            break;
        case DevicePinFunction::WAKEUP:
            status = true;
            break;
        default:
            status = false;
            break;
    }
    if (status)
    {
        devicePin.CurrentFunction = function;
    }
    return status;
}
bool GpioIO::SetLowPower(PinNameValue pinNumber)
{
    int GPIOPortByNumber = pinNumber / 16;
    uint32_t gpioPortPinNumber = pinNumber % 16;

    // Set the unused pins as input(floating) to minimize current consumption.
    LL_GPIO_SetPinMode(Port[GPIOPortByNumber], PinMask[gpioPortPinNumber], LL_GPIO_MODE_INPUT);
    LL_GPIO_SetPinPull(Port[GPIOPortByNumber], PinMask[gpioPortPinNumber], LL_GPIO_PULL_NO);

    return true;
}
bool GpioIO::SetMode(PinNameValue pinNameValue, PinMode pinMode)
{
    bool status = false;
    int GPIOPortByNumber = pinNameValue / 16;
    uint32_t gpioPortPinNumber = pinNameValue % 16;
    switch (pinMode)
    {
        case PinMode_Input:
            LL_GPIO_SetPinOutputType(Port[GPIOPortByNumber], PinMask[gpioPortPinNumber], LL_GPIO_MODE_INPUT);
            LL_GPIO_SetPinPull(Port[GPIOPortByNumber], PinMask[gpioPortPinNumber], LL_GPIO_PULL_NO);
            status = true;
            break;
        case PinMode_InputPullDown:
            LL_GPIO_SetPinOutputType(Port[GPIOPortByNumber], PinMask[gpioPortPinNumber], LL_GPIO_MODE_INPUT);
            LL_GPIO_SetPinPull(Port[GPIOPortByNumber], PinMask[gpioPortPinNumber], LL_GPIO_PULL_DOWN);
            status = true;
            break;
        case PinMode_InputPullUp:
            LL_GPIO_SetPinOutputType(Port[GPIOPortByNumber], PinMask[gpioPortPinNumber], LL_GPIO_MODE_INPUT);
            LL_GPIO_SetPinPull(Port[GPIOPortByNumber], PinMask[gpioPortPinNumber], LL_GPIO_PULL_UP);
            status = true;
            break;
        case PinMode_Output:
            LL_GPIO_SetPinOutputType(Port[GPIOPortByNumber], PinMask[gpioPortPinNumber], LL_GPIO_OUTPUT_PUSHPULL);
            status = true;
            break;
        case PinMode_OutputOpenDrain:
            LL_GPIO_SetPinOutputType(Port[GPIOPortByNumber], PinMask[gpioPortPinNumber], LL_GPIO_OUTPUT_OPENDRAIN);
            status = true;
            break;
        case PinMode_OutputOpenDrainPullUp:
            LL_GPIO_SetPinOutputType(Port[GPIOPortByNumber], PinMask[gpioPortPinNumber], LL_GPIO_OUTPUT_OPENDRAIN);
            status = true;
            break;
        case PinMode_OutputOpenSource:
            LL_GPIO_SetPinOutputType(Port[GPIOPortByNumber], PinMask[gpioPortPinNumber], LL_GPIO_OUTPUT_OPENDRAIN);
            status = true;
            break;
        case PinMode_OutputOpenSourcePullDown:
            LL_GPIO_SetPinOutputType(Port[GPIOPortByNumber], PinMask[gpioPortPinNumber], LL_GPIO_OUTPUT_OPENDRAIN);
            status = true;
            break;
        default:
            status = false;
            break;
    }
    return status;
}
bool GpioIO::InterruptEnable(
    PinNameValue pinNameValue,
    GPIO_INT_EDGE events,
    GPIO_INTERRUPT_SERVICE_ROUTINE gpioIsrPtr)
{
    // NOTE: There is a limitation of 16 external interrupts on the GPIO lines with one 1 interrupt per line number.
    //      One interrupt on (PA0 or PB0 or PC0 or PD0...) and one interrupt on (PA1, or PB1 or PC1 ...) etc.
    bool expectedState = false;
    int GPIOPortByNumber = pinNameValue / 16;
    uint32_t gpioPortPinNumber = pinNameValue % 16;
    uint32_t priority = 0;
    SavedInterruptCallBack[gpioPortPinNumber] = &gpioIsrPtr;
    LL_SYSCFG_SetEXTISource(SyscfgPorts[GPIOPortByNumber], PinMask[gpioPortPinNumber]);
    switch (events)
    {
        case GPIO_INT_NONE:
            LL_EXTI_DisableFallingTrig_0_31(EXTI_Line[gpioPortPinNumber]);
            LL_EXTI_DisableRisingTrig_0_31(EXTI_Line[gpioPortPinNumber]);
            expectedState = false;
            break;
        case GPIO_INT_EDGE_LOW:
            LL_EXTI_EnableFallingTrig_0_31(EXTI_Line[gpioPortPinNumber]);
            LL_EXTI_DisableRisingTrig_0_31(EXTI_Line[gpioPortPinNumber]);
            expectedState = false;
            break;
        case GPIO_INT_LEVEL_LOW:
            LL_EXTI_EnableFallingTrig_0_31(EXTI_Line[gpioPortPinNumber]);
            LL_EXTI_DisableRisingTrig_0_31(EXTI_Line[gpioPortPinNumber]);
            expectedState = false;
            break;
        case GPIO_INT_EDGE_HIGH:
            LL_EXTI_EnableRisingTrig_0_31(EXTI_Line[gpioPortPinNumber]);
            LL_EXTI_DisableFallingTrig_0_31(EXTI_Line[gpioPortPinNumber]);
            expectedState = false;
            break;
        case GPIO_INT_LEVEL_HIGH:
            LL_EXTI_EnableRisingTrig_0_31(EXTI_Line[gpioPortPinNumber]);
            LL_EXTI_DisableFallingTrig_0_31(EXTI_Line[gpioPortPinNumber]);
            expectedState = false;
            break;
            LL_EXTI_EnableFallingTrig_0_31(EXTI_Line[gpioPortPinNumber]);
            LL_EXTI_EnableRisingTrig_0_31(EXTI_Line[gpioPortPinNumber]);
            expectedState = false;
            break;
        case GPIO_INT_EDGE_BOTH:
            LL_EXTI_EnableFallingTrig_0_31(EXTI_Line[gpioPortPinNumber]);
            LL_EXTI_EnableRisingTrig_0_31(EXTI_Line[gpioPortPinNumber]);
            expectedState = false;
            break;
    }
    switch (gpioPortPinNumber)
    {
        case 0:
            NVIC_SetPriority(EXTI0_IRQn, priority);
            NVIC_EnableIRQ(EXTI0_IRQn);
            break;
        case 1:
            NVIC_SetPriority(EXTI1_IRQn, priority);
            NVIC_EnableIRQ(EXTI1_IRQn);
            break;
        case 2:
            NVIC_SetPriority(EXTI2_IRQn, priority);
            NVIC_EnableIRQ(EXTI2_IRQn);
            break;
        case 3:
            NVIC_SetPriority(EXTI3_IRQn, priority);
            NVIC_EnableIRQ(EXTI3_IRQn);
            break;
        case 4:
            NVIC_SetPriority(EXTI4_IRQn, priority);
            NVIC_EnableIRQ(EXTI4_IRQn);
            break;
        case 5:
            NVIC_SetPriority(EXTI9_5_IRQn, priority);
            NVIC_EnableIRQ(EXTI9_5_IRQn);
            break;
        case 6:
            NVIC_SetPriority(EXTI9_5_IRQn, priority);
            NVIC_EnableIRQ(EXTI9_5_IRQn);
            break;
        case 7:
            NVIC_SetPriority(EXTI9_5_IRQn, priority);
            NVIC_EnableIRQ(EXTI9_5_IRQn);
            break;
        case 8:
            NVIC_SetPriority(EXTI9_5_IRQn, priority);
            NVIC_EnableIRQ(EXTI9_5_IRQn);
            break;
        case 9:
            NVIC_SetPriority(EXTI9_5_IRQn, priority);
            NVIC_EnableIRQ(EXTI9_5_IRQn);
            break;
        case 10:
            NVIC_SetPriority(EXTI15_10_IRQn, priority);
            NVIC_EnableIRQ(EXTI15_10_IRQn);
            break;
        case 11:
            NVIC_SetPriority(EXTI15_10_IRQn, priority);
            NVIC_EnableIRQ(EXTI15_10_IRQn);
            break;
        case 12:
            NVIC_SetPriority(EXTI15_10_IRQn, priority);
            NVIC_EnableIRQ(EXTI15_10_IRQn);
            break;
        case 13:
            NVIC_SetPriority(EXTI15_10_IRQn, priority);
            NVIC_EnableIRQ(EXTI15_10_IRQn);
            break;
        case 14:
            NVIC_SetPriority(EXTI15_10_IRQn, priority);
            NVIC_EnableIRQ(EXTI15_10_IRQn);
            break;
        case 15:
            NVIC_SetPriority(EXTI15_10_IRQn, priority);
            NVIC_EnableIRQ(EXTI15_10_IRQn);
            break;
    }
    LL_EXTI_EnableIT_0_31(EXTI_Line[gpioPortPinNumber]);
    LL_EXTI_ClearFlag_0_31(EXTI_Line[gpioPortPinNumber]);

    return expectedState;
}
bool GpioIO::InterruptDisable(PinNameValue pinNameValue)
{
    uint32_t gpioPortPinNumber = pinNameValue % 16;
    LL_D3_EXTI_DisablePendMask_0_31(EXTI_Line[gpioPortPinNumber]);
    LL_EXTI_DisableIT_0_31(EXTI_Line[gpioPortPinNumber]);
    LL_EXTI_DisableFallingTrig_0_31(EXTI_Line[gpioPortPinNumber]);
    LL_EXTI_DisableRisingTrig_0_31(EXTI_Line[gpioPortPinNumber]);
    SYSCFG->EXTICR[EXTI_Line[gpioPortPinNumber] & 0x3U] |= ~(EXTI_Line[gpioPortPinNumber] >> 16U);
    return true;
}
bool GpioIO::InterruptRemove(PinNameValue pinNameValue)
{
    uint32_t gpioPortPinNumber = pinNameValue % 16;
    // Clear the External Interrupt or Event for the current IO
    LL_D3_EXTI_DisablePendMask_0_31(EXTI_Line[gpioPortPinNumber]);
    LL_EXTI_DisableIT_0_31(EXTI_Line[gpioPortPinNumber]);
    LL_EXTI_DisableFallingTrig_0_31(EXTI_Line[gpioPortPinNumber]);
    LL_EXTI_DisableRisingTrig_0_31(EXTI_Line[gpioPortPinNumber]);

