TerryFogg/nf-Community-Targets/ThreadX/ST/STM32F0/Common/DeviceIO.cpp
    switch (I2C_deviceId)
    {
        case 1:
            LL_APB4_GRP1_EnableClock(LL_APB1_GRP1_PERIPH_I2C1);
            LL_RCC_SetI2CClockSource(LL_RCC_I2C123_CLKSOURCE_PCLK1);
            break;
        case 2:
            LL_APB4_GRP1_EnableClock(LL_APB1_GRP1_PERIPH_I2C2);
            LL_RCC_SetI2CClockSource(LL_RCC_I2C123_CLKSOURCE_PCLK1);
            break;
        case 3:
            LL_APB4_GRP1_EnableClock(LL_APB1_GRP1_PERIPH_I2C3);
            LL_RCC_SetI2CClockSource(LL_RCC_I2C123_CLKSOURCE_PCLK1);
            break;
        case 4:
            LL_APB4_GRP1_EnableClock(LL_APB4_GRP1_PERIPH_I2C4);
            LL_RCC_SetI2CClockSource(LL_RCC_I2C4_CLKSOURCE_PCLK4);
            break;
#ifdef I2C5
        case 5:
            LL_APB4_GRP1_EnableClock(LL_APB1_GRP1_PERIPH_I2C5);
            // LL_RCC_SetI2CClockSource(LL_RCC_I2C5_CLKSOURCE_PCLK1);
            break;
#endif
    }
    LL_I2C_Disable(I2C_Channel[I2C_deviceId]);
    {
        LL_I2C_ConfigFilters(I2C_Channel[I2C_deviceId], LL_I2C_ANALOGFILTER_ENABLE, 0);
        LL_I2C_SetTiming(I2C_Channel[I2C_deviceId], I2C_GetTiming(I2C_speed));
        LL_I2C_SetMode(I2C_Channel[I2C_deviceId], LL_I2C_MODE_I2C);
        LL_I2C_DisableClockStretching(I2C_Channel[I2C_deviceId]);
        LL_I2C_DisableGeneralCall(I2C_Channel[I2C_deviceId]);

        LL_I2C_SetOwnAddress1(I2C_Channel[I2C_deviceId], 0, LL_I2C_OWNADDRESS1_7BIT);
        LL_I2C_SetMasterAddressingMode(I2C_Channel[I2C_deviceId], LL_I2C_ADDRESSING_MODE_7BIT);
        LL_I2C_AcknowledgeNextData(I2C_Channel[I2C_deviceId], LL_I2C_ACK);
        LL_I2C_DisableOwnAddress1(I2C_Channel[I2C_deviceId]);
        LL_I2C_DisableOwnAddress2(I2C_Channel[I2C_deviceId]);

        // Interrupt versions ( TO BE CONTINUED )
        //// Enable Receive Interrupt
        // LL_I2C_EnableIT_RX(I2C_Channel[busIndex]);
        //// Enable Not acknowledge received interrupt
        // LL_I2C_EnableIT_NACK(I2C_Channel[busIndex]);
        //// Enable Error interrupts
        // LL_I2C_EnableIT_ERR(I2C_Channel[busIndex]);
        //// Enable Stop interrupt
        // LL_I2C_EnableIT_STOP(I2C_Channel[busIndex]);
    }
    LL_I2C_Enable(I2C_Channel[I2C_deviceId]);
    NVIC_SetPriority(I2C_Interrupt_Channel[I2C_deviceId], 0);
    NVIC_EnableIRQ(I2C_Interrupt_Channel[I2C_deviceId]);

    return true;
}
bool I2cIO::Dispose(CLR_INT32 I2C_deviceId)
{
    bool status = false;
    switch (I2C_deviceId)
    {
        case 1:
            LL_APB4_GRP1_ReleaseReset(LL_APB1_GRP1_PERIPH_I2C1);
            LL_APB4_GRP1_ForceReset(LL_RCC_I2C123_CLKSOURCE_PCLK1);
            status = true;
            break;
        case 2:
            LL_APB4_GRP1_ReleaseReset(LL_APB1_GRP1_PERIPH_I2C2);
            LL_APB4_GRP1_ForceReset(LL_RCC_I2C123_CLKSOURCE_PCLK1);
            status = true;
            break;
        case 3:
            LL_APB4_GRP1_ReleaseReset(LL_APB1_GRP1_PERIPH_I2C3);
            LL_APB4_GRP1_ForceReset(LL_RCC_I2C123_CLKSOURCE_PCLK1);
            status = true;
            break;
        case 4:
            LL_APB4_GRP1_ReleaseReset(LL_APB4_GRP1_PERIPH_I2C4);
            LL_APB4_GRP1_ForceReset(LL_RCC_I2C4_CLKSOURCE_PCLK4);
            status = true;
            break;
#ifdef I2C5
        case 5:
            LL_APB4_GRP1_ReleaseReset(LL_APB1_GRP1_PERIPH_I2C5);
            // LL_APB4_GRP1_ForceReset(LL_RCC_I2C5_CLKSOURCE_PCLK1);
            status = true;
            break;
#endif
        default:
            status = false;
            break;
    }
    if (status)
    {
        PinNameValue pinNameValueSCL = FindPinWithFunctionAndChannel(DevicePinFunction::I2C, I2C_deviceId);
        PinNameValue pinNameValueSDA = FindPinWithFunctionAndChannel(DevicePinFunction::I2C, I2C_deviceId);
        GpioIO::SetLowPower(pinNameValueSCL);
        GpioIO::SetLowPower(pinNameValueSDA);
    }
    return status;
}
CLR_INT32 I2cIO::Write(
    CLR_INT32 I2C_deviceId,
    CLR_INT32 slaveAddress,
    CLR_UINT8 *writeBuffer,
    CLR_INT32 writeSize,
    CLR_INT32 *transferResult)
{
    bool status = false;
    LL_I2C_HandleTransfer(
        I2C_Channel[I2C_deviceId],
        slaveAddress,
        LL_I2C_ADDRSLAVE_7BIT,
        writeSize,
        LL_I2C_MODE_SOFTEND,
        LL_I2C_GENERATE_START_WRITE);
    LL_I2C_TransmitData8(I2C_Channel[I2C_deviceId], 0);
    while (!LL_I2C_IsActiveFlag_TXE(I2C_Channel[I2C_deviceId]))
        ;
    // sending the data
    for (uint8_t i = 0; i < writeSize; i++)
    {
        LL_I2C_TransmitData8(I2C_Channel[I2C_deviceId], writeBuffer[i]);
        while (!LL_I2C_IsActiveFlag_TXE(I2C_Channel[I2C_deviceId]))
            writeBuffer++;
    }
    status = true;
    *transferResult = 1;
    return status;
}

bool I2cIO::Read(
    CLR_INT32 I2C_deviceId,
    CLR_INT32 slaveAddress,
    CLR_UINT8 *readBuffer,
    CLR_INT32 readSize,
    CLR_INT32 *transferResult)
{
    (void)transferResult;

    bool status = false;
    LL_I2C_AcknowledgeNextData(I2C_Channel[I2C_deviceId], LL_I2C_ACK);
    LL_I2C_HandleTransfer(
        I2C_Channel[I2C_deviceId],
        (slaveAddress | 1),
        LL_I2C_ADDRSLAVE_7BIT,
        readSize,
        LL_I2C_MODE_AUTOEND,
        LL_I2C_GENERATE_START_READ);
    for (uint8_t i = 0; i < readSize; i++)
    {
        if (i < readSize - 1)
            LL_I2C_AcknowledgeNextData(I2C_Channel[I2C_deviceId], LL_I2C_ACK);
        else
            LL_I2C_AcknowledgeNextData(I2C_Channel[I2C_deviceId], LL_I2C_NACK);
        while (LL_I2C_IsActiveFlag_RXNE(I2C_Channel[I2C_deviceId]) == 0)
            ;
        readBuffer[i] = LL_I2C_ReceiveData8(I2C_Channel[I2C_deviceId]);
    }
    status = true;
    // Optional?
    // LL_I2C_GenerateStopCondition(I2C_Channel[busIndex]);
    return status;
}
#pragma endregion

#pragma region I2c_Slave
CLR_INT32 I2cIO_Slave::TimeoutMaximum()
{
    return 10000;
}
CLR_INT32 I2cIO_Slave::Timeout()
{
    return 100;
}
bool I2cIO_Slave::Initialize(CLR_INT32 I2C_deviceId, CLR_INT32 deviceAddress)
{
    LL_RCC_ClocksTypeDef RCC_Clocks;
    LL_RCC_GetSystemClocksFreq(&RCC_Clocks);

