TerryFogg/nf-Community-Targets/ThreadX/ST/STM32F0/Common/DeviceIO.cpp
    switch (I2C_deviceId)
    {
        case 1:
            LL_APB4_GRP1_EnableClock(LL_APB1_GRP1_PERIPH_I2C1);
            LL_RCC_SetI2CClockSource(LL_RCC_I2C123_CLKSOURCE_PCLK1);
            break;
        case 2:
            LL_APB4_GRP1_EnableClock(LL_APB1_GRP1_PERIPH_I2C2);
            LL_RCC_SetI2CClockSource(LL_RCC_I2C123_CLKSOURCE_PCLK1);
            break;
        case 3:
            LL_APB4_GRP1_EnableClock(LL_APB1_GRP1_PERIPH_I2C3);
            LL_RCC_SetI2CClockSource(LL_RCC_I2C123_CLKSOURCE_PCLK1);
            break;
        case 4:
            LL_APB4_GRP1_EnableClock(LL_APB4_GRP1_PERIPH_I2C4);
            LL_RCC_SetI2CClockSource(LL_RCC_I2C4_CLKSOURCE_PCLK4);
            break;
#ifdef I2C5
        case 5:
            LL_APB4_GRP1_EnableClock(LL_APB1_GRP1_PERIPH_I2C5);
            // LL_RCC_SetI2CClockSource(LL_RCC_I2C5_CLKSOURCE_PCLK1);
            break;
#endif
    }

    I2cBusSpeed TODOSPEED = I2cBusSpeed::I2cBusSpeed_StandardMode;
    LL_I2C_Disable(I2C_Channel[I2C_deviceId]);
    {
        LL_I2C_ConfigFilters(I2C_Channel[I2C_deviceId], LL_I2C_ANALOGFILTER_ENABLE, 0);
        LL_I2C_SetTiming(I2C_Channel[I2C_deviceId], I2C_GetTiming(TODOSPEED));
        LL_I2C_SetMode(I2C_Channel[I2C_deviceId], LL_I2C_MODE_I2C);
        LL_I2C_DisableClockStretching(I2C_Channel[I2C_deviceId]);
        LL_I2C_DisableGeneralCall(I2C_Channel[I2C_deviceId]);

        // Reset Value is Clock stretching enabled
        LL_I2C_SetOwnAddress1(I2C_Channel[I2C_deviceId], deviceAddress, LL_I2C_OWNADDRESS1_7BIT);
        LL_I2C_SetOwnAddress2(I2C_Channel[I2C_deviceId], 0x00, LL_I2C_OWNADDRESS2_NOMASK);
        LL_I2C_EnableOwnAddress1(I2C_Channel[I2C_deviceId]);
        LL_I2C_DisableOwnAddress2(I2C_Channel[I2C_deviceId]);
        LL_I2C_AcknowledgeNextData(I2C_Channel[I2C_deviceId], LL_I2C_NACK);

        // Interrupt versions ( TO BE CONTINUED )
        //// Enable Receive Interrupt
        // LL_I2C_EnableIT_RX(I2C_Channel[busIndex]);
        //// Enable Not acknowledge received interrupt
        // LL_I2C_EnableIT_NACK(I2C_Channel[busIndex]);
        //// Enable Error interrupts
        // LL_I2C_EnableIT_ERR(I2C_Channel[busIndex]);
        //// Enable Stop interrupt
        // LL_I2C_EnableIT_STOP(I2C_Channel[busIndex]);
    }
    LL_I2C_Enable(I2C_Channel[I2C_deviceId]);
    NVIC_SetPriority(I2C_Interrupt_Channel[I2C_deviceId], 0);
    NVIC_EnableIRQ(I2C_Interrupt_Channel[I2C_deviceId]);

    return true;
}
bool I2cIO_Slave::Dispose(CLR_INT32 I2C_deviceId)
{
    (void)I2C_deviceId;
    return true;
}
bool I2cIO_Slave::Write(
    CLR_INT32 I2C_deviceId,
    CLR_UINT8 *writeBuffer,
    CLR_INT32 writeSize,
    CLR_INT32 timeoutMilliseconds,
    CLR_INT32 *readCount,
    CLR_INT32 *transferResult)
{
    (void)I2C_deviceId;
    (void)writeBuffer;
    (void)writeSize;
    (void)timeoutMilliseconds;
    (void)readCount;
    (void)transferResult;
    return true;
}
bool I2cIO_Slave::Read(
    CLR_INT32 I2C_deviceId,
    CLR_UINT8 *readBuffer,
    CLR_INT32 readSize,
    CLR_INT32 timeoutMilliseconds,
    CLR_INT32 *readCount,
    CLR_INT32 *transferResult)
{
    (void)I2C_deviceId;
    (void)readBuffer;
    (void)readSize;
    (void)timeoutMilliseconds;
    (void)readCount;
    (void)transferResult;
    return true;
}
#pragma endregion

#pragma region PWM
bool PwmIO::Initialize(
    CLR_INT32 channelId,
    CLR_INT32 timerId,
    CLR_INT32 pinNumber,
    CLR_INT32 polarity,
    CLR_INT32 desiredFrequency,
    CLR_INT32 dutyCycle)
{
    (void)channelId;
    (void)timerId;
    (void)pinNumber;
    (void)polarity;
    (void)desiredFrequency;
    (void)dutyCycle;
    return true;
}
bool PwmIO::Dispose(CLR_INT32 I2C_deviceId)
{
    // TODO: Deactive PWM, set pins to low power
    // Get each pin and set to low power function
    (void)I2C_deviceId;
    return true;
}
CLR_UINT32 PwmIO::SetDutyCycle(CLR_INT32 pinNumber, CLR_INT32 desiredFrequency)
{
    (void)pinNumber;
    (void)desiredFrequency;
    return 1;
}
CLR_UINT32 PwmIO::Start(CLR_INT32 pinNumber, CLR_INT32 timerId)
{
    (void)pinNumber;
    (void)timerId;
    return 1;
}
CLR_UINT32 PwmIO::Stop(CLR_INT32 pinNumber, CLR_INT32 timerId)
{
    (void)pinNumber;
    (void)timerId;
    return 1;
}
CLR_UINT32 PwmIO::DesiredFrequency(CLR_INT32 timerId, CLR_INT32 desiredFrequency)
{
    (void)timerId;
    (void)desiredFrequency;
    return 1;
}
CLR_UINT32 PwmIO::GetChannel(CLR_INT32 timerId, CLR_INT32 pinNumber)
{
    (void)timerId;
    (void)pinNumber;
    return 1;
}
#pragma endregion

#pragma region Serial IO
#include "CircularBuffer.h"

#define MAXIMUM_NUMBER_OF_ACTIVE_USARTS 5

int CircularBufferAssignments[]{
    -1, // Index 0 not used
    0,  // Usart1 - CircularBuffer[0]
    1,  // Usart2 - CircularBuffer[0]
    2,  // Usart3 - CircularBuffer[0]
    -1, // Usart4 - Not used
    -1, // Usart5 - Not used
    3,  // Usart6 - CircularBuffer[0]
    -1, // Usart7 - Not used
    -1, // Usart8 - Not used
    -1, // Usart9 - Not used
    4   // Usart10 - CircularBuffer[0]
};
CircularBuffer_t DeviceReceiveCircularBuffer[MAXIMUM_NUMBER_OF_ACTIVE_USARTS];
CircularBuffer_t DeviceTransmitCircularBuffer[MAXIMUM_NUMBER_OF_ACTIVE_USARTS];

__attribute__((section(".dma_buffer"))) __attribute__((aligned(32)))
uint8_t UsartDmaReceiveBuffer[512][MAXIMUM_NUMBER_OF_ACTIVE_USARTS];
__attribute__((section(".dma_buffer"))) __attribute__((aligned(32)))
uint8_t UsartTransmitData[512][MAXIMUM_NUMBER_OF_ACTIVE_USARTS];
//  Length of currently active TX DMA transfer
volatile size_t device_usart_tx_dma_current_len[MAXIMUM_NUMBER_OF_ACTIVE_USARTS];
__attribute__((section(".dma_buffer"))) __attribute__((aligned(32))) uint8_t DmaReceiveBuffer[1024];
static_assert((sizeof(DmaReceiveBuffer) % 32) == 0, "Must be a multiple by 32");

int GetSerialDeviceBufferIndex(int UsartDeviceNumber)
{
    return CircularBufferAssignments[UsartDeviceNumber];
}

bool SerialIO::Initialize(CLR_INT32 usartDeviceNumber, CLR_INT32 baudrate)
{
    bool status = false;
    USART_TypeDef *USARTx = (USART_TypeDef *)Serial_Channel[usartDeviceNumber].controllerId;
    LL_USART_InitTypeDef USART_InitStruct;

    switch (usartDeviceNumber)
    {
        case 1:
        case 6:
        case 10:
            LL_APB2_GRP1_EnableClock(UsartPortClockEnable[usartDeviceNumber]);
            status = true;
            break;
        case 2:
        case 3:
            LL_APB1_GRP1_EnableClock(UsartPortClockEnable[usartDeviceNumber]);
            status = true;
            break;
        default:
            status = false;
            break;
    }
    if (status)
    {
        LL_AHB1_GRP1_EnableClock(DmaClockEnable[usartDeviceNumber]);
        DMA_TypeDef *DMAx = DMA_Channel[usartDeviceNumber];

        // wpUSART Receive Initialize
        LL_DMA_SetPeriphRequest(DMAx, wpDMA_ReceiveStream, wpDMA_ReceiveMux);
        LL_DMA_SetDataTransferDirection(DMAx, wpDMA_ReceiveStream, LL_DMA_DIRECTION_PERIPH_TO_MEMORY);
        LL_DMA_SetStreamPriorityLevel(DMAx, wpDMA_ReceiveStream, LL_DMA_PRIORITY_LOW);
        LL_DMA_SetMode(DMAx, wpDMA_ReceiveStream, LL_DMA_MODE_CIRCULAR);
        LL_DMA_SetPeriphIncMode(DMAx, wpDMA_ReceiveStream, LL_DMA_PERIPH_NOINCREMENT);
        LL_DMA_SetMemoryIncMode(DMAx, wpDMA_ReceiveStream, LL_DMA_MEMORY_INCREMENT);
        LL_DMA_SetMemorySize(DMAx, wpDMA_ReceiveStream, LL_DMA_MDATAALIGN_BYTE);
        LL_DMA_SetPeriphSize(DMAx, wpDMA_ReceiveStream, LL_DMA_PDATAALIGN_BYTE);
        LL_DMA_DisableFifoMode(DMAx, wpDMA_ReceiveStream);
        LL_DMA_SetPeriphAddress(
            DMAx,
            wpDMA_ReceiveStream,
            LL_USART_DMA_GetRegAddr(USARTx, LL_USART_DMA_REG_DATA_RECEIVE));
        LL_DMA_SetMemoryAddress(DMAx, wpDMA_ReceiveStream, (uint32_t)DmaReceiveBuffer);
        LL_DMA_SetDataLength(DMAx, wpDMA_ReceiveStream, ARRAY_LEN(DmaReceiveBuffer));

