TerryFogg/nf-Community-Targets/ThreadX/ST/STM32F0/Common/DeviceIO.cpp
    bool status = false;
    switch (handshake)
    {
        case Handshake::Handshake_None:
            status = true;
            break;
        case Handshake_XOnXOff:
            break;
        case Handshake::Handshake_RequestToSend:
            status = true;
            break;
        case Handshake::Handshake_RequestToSendXOnXOff:
            status = true;
            break;
    }
    return status;
}
bool SerialIO::SetMode(CLR_INT32 usartDeviceNumber, CLR_INT32 mode)
{
    UNUSED(usartDeviceNumber);
    UNUSED(mode);
    return true;
}



HRESULT SerialIO::SetupWriteLine(CLR_RT_StackFrame& stack, char** buffer, uint32_t* length, bool* isNewAllocation)
{
    UNUSED(stack);
    UNUSED(buffer);
    UNUSED(length);
    UNUSED(isNewAllocation);
    return 1;
}


#pragma endregion

#pragma region SPI
CLR_INT32 SpiIO::MaximumClockFrequency(CLR_INT32 deviceId)
{
    UNUSED(deviceId);
    return 1;
}
CLR_INT32 SpiIO::MinimumClockFrequency(CLR_INT32 deviceId)
{
    UNUSED(deviceId);
    return 1;
}
bool SpiIO::Initialize()
{
    return true;
}
bool SpiIO::Dispose(CLR_INT32 deviceId)
{
    UNUSED(deviceId);
    return true;
}
bool SpiIO::WriteRead(
    CLR_INT32 deviceId,
    SPI_WRITE_READ_SETTINGS rws,
    CLR_UINT8 *writeData,
    CLR_UINT16 writeSize,
    CLR_UINT8 *readData,
    CLR_UINT16 readSize)
{
    UNUSED(deviceId);
    UNUSED(rws);
    UNUSED(*writeData);
    UNUSED(writeSize);
    UNUSED(*readData);
    UNUSED(readSize);
    return false;
}
bool SpiIO::Open(SPI_DEVICE_CONFIGURATION spiConfig, CLR_UINT32 handle)
{
    (void)spiConfig;
    (void)handle;

    return false;
}

CLR_INT32 SpiIO::ByteTime()
{
    return 1;
}
SPI_OP_STATUS SpiIO::Completed(CLR_INT32 deviceId)
{
    UNUSED(deviceId);
    return SPI_OP_STATUS::SPI_OP_COMPLETE;
}

#pragma endregion

